# EDA

## Imports

In [2]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns

## Data

In [1]:
path_data_cat = './data/data_subset_categorical.xlsx'
path_data_cont = './data/data_subset_continous.xlsx'
path_data_ord = './data/data_subset_ordinal.xlsx'

### Categorical Data

In [3]:
cat_df = pd.read_excel(path_data_cat)
cat_df

,Attrition,BusinessTravel,Department,EducationField,Gender,JobRole,MaritalStatus,OverTime
0,Yes,Travel_Rarely,Sales,Life Sciences,Female,Sales Executive,Single,Yes
1,No,Travel_Frequently,Research & Development,Life Sciences,Male,Research Scientist,Married,No
2,Yes,Travel_Rarely,Research & Development,Other,Male,Laboratory Technician,Single,Yes
3,No,Travel_Frequently,Research & Development,Life Sciences,Female,Research Scientist,Married,Yes
4,No,Travel_Rarely,Research & Development,Medical,Male,Laboratory Technician,Married,No
...,...,...,...,...,...,...,...,...
1465,No,Travel_Frequently,Research & Development,Medical,Male,Laboratory Technician,Married,No
1466,No,Travel_Rarely,Research & Development,Medical,Male,Healthcare Representative,Married,No
1467,No,Travel_Rarely,Research & Development,Life Sciences,Male,Manufacturing Director,Married,Yes
1468,No,Travel_Frequently,Sales,Medical,Male,Sales Executive,Married,No
1469,No,Travel_Rarely,Research & Development,Medical,Male,Laboratory Technician,Married,No

### Continous Data

In [4]:
cont_df = pd.read_excel(path_data_cont)
cont_df

,Age,DailyRate,DistanceFromHome,EmployeeNumber,HourlyRate,MonthlyIncome,MonthlyRate,NumCompaniesWorked,PercentSalaryHike,TotalWorkingYears,TrainingTimesLastYear,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,1102,1,1,94,5993,19479,8,11,8,0,6,4,0,5
1,49,279,8,2,61,5130,24907,1,23,10,3,10,7,1,7
2,37,1373,2,4,92,2090,2396,6,15,7,3,0,0,0,0
3,33,1392,3,5,56,2909,23159,1,11,8,3,8,7,3,0
4,27,591,2,7,40,3468,16632,9,12,6,3,2,2,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,36,884,23,2061,41,2571,12290,4,17,17,3,5,2,0,3
1466,39,613,6,2062,42,9991,21457,4,15,9,5,7,7,1,7
1467,27,155,4,2064,87,6142,5174,1,20,6,0,6,2,0,3
1468,49,1023,2,2065,63,5390,13243,2,14,17,3,9,6,0,8
1469,34,628,8,2068,82,4404,10228,2,12,6,3,4,3,1,2

### Ordinal Data

In [5]:
ord_df = pd.read_excel(path_data_ord)
ord_df

,PerformanceRating,RelationshipSatisfaction,EnvironmentSatisfaction,WorkLifeBalance,JobInvolvement,StockOptionLevel,JobSatisfaction,JobLevel,Education
0,3,1,2,1,3,0,4,2,2
1,4,4,3,3,2,1,2,2,1
2,3,2,4,3,2,0,3,1,2
3,3,3,4,3,3,0,3,1,4
4,3,4,1,3,3,1,2,1,1
...,...,...,...,...,...,...,...,...,...
1465,3,3,3,3,4,1,4,2,2
1466,3,1,4,3,2,1,1,3,1
1467,4,2,2,3,4,1,2,2,3
1468,3,4,4,2,2,0,2,2,3
1469,3,1,2,4,4,0,3,2,3

# EDA by Feature

In [6]:
cat_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Attrition       1470 non-null   object
 1   BusinessTravel  1470 non-null   object
 2   Department      1470 non-null   object
 3   EducationField  1470 non-null   object
 4   Gender          1470 non-null   object
 5   JobRole         1470 non-null   object
 6   MaritalStatus   1470 non-null   object
 7   OverTime        1470 non-null   object
dtypes: object(8)
memory usage: 92.0+ KB